In [3]:
import pandas as pd
import random
data = {
    'Nom': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Âge': [25, 30, 35, 40, 45],
    'Ville': ['Paris', 'Lyon', 'Marseille', 'Toulouse', 'Nice'],
    'Salaire': [3000, 3500, 4000, 4500, 5000]
}
df = pd.DataFrame(data)

print(df)

       Nom  Âge      Ville  Salaire
0    Alice   25      Paris     3000
1      Bob   30       Lyon     3500
2  Charlie   35  Marseille     4000
3    David   40   Toulouse     4500
4      Eva   45       Nice     5000

In [4]:
df.head(2)

     Nom  Âge  Ville  Salaire
0  Alice   25  Paris     3000
1    Bob   30   Lyon     3500

In [5]:
df.tail(2)

     Nom  Âge     Ville  Salaire
3  David   40  Toulouse     4500
4    Eva   45      Nice     5000

In [6]:
df.dtypes

Nom        object
Âge         int64
Ville      object
Salaire     int64
dtype: object

In [7]:
df['Nom']

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Nom, dtype: object

In [8]:
df[['Nom','Âge']]

       Nom  Âge
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eva   45

In [9]:
df[df['Âge']>30]

       Nom  Âge      Ville  Salaire
2  Charlie   35  Marseille     4000
3    David   40   Toulouse     4500
4      Eva   45       Nice     5000

In [12]:
df['bonus'] = df['Salaire'] * 0.1
df.head(2)

     Nom  Âge  Ville  Salaire  bonus
0  Alice   25  Paris     3000  300.0
1    Bob   30   Lyon     3500  350.0

In [13]:
df.rename(columns = {'Salaire' : 'SalaireMensuel'},inplace =  True)
df.head(2)

     Nom  Âge  Ville  SalaireMensuel  bonus
0  Alice   25  Paris            3000  300.0
1    Bob   30   Lyon            3500  350.0

In [15]:
df.drop(columns = ['bonus'],inplace = True)
df.head(2)

     Nom  Âge  Ville  SalaireMensuel
0  Alice   25  Paris            3000
1    Bob   30   Lyon            3500

In [18]:
df.sort_values(by = 'Âge' , ascending = False)

       Nom  Âge      Ville  SalaireMensuel
4      Eva   45       Nice            5000
3    David   40   Toulouse            4500
2  Charlie   35  Marseille            4000
1      Bob   30       Lyon            3500
0    Alice   25      Paris            3000

In [19]:
df.describe()

             Âge  SalaireMensuel
count   5.000000        5.000000
mean   35.000000     4000.000000
std     7.905694      790.569415
min    25.000000     3000.000000
25%    30.000000     3500.000000
50%    35.000000     4000.000000
75%    40.000000     4500.000000
max    45.000000     5000.000000

In [20]:
df['Âge'].mean()

35.0

In [21]:
df['Ville'].value_counts

<bound method IndexOpsMixin.value_counts of 0        Paris
1         Lyon
2    Marseille
3     Toulouse
4         Nice
Name: Ville, dtype: object>

In [22]:
df.isnull().sum()

Nom               0
Âge               0
Ville             0
SalaireMensuel    0
dtype: int64

In [23]:
df.fillna(0,inplace = True) # Remplace les NaN par 0

In [25]:
df.groupby('Ville')['SalaireMensuel'].mean()

Ville
Lyon         3500.0
Marseille    4000.0
Nice         5000.0
Paris        3000.0
Toulouse     4500.0
Name: SalaireMensuel, dtype: float64

In [27]:
df.groupby('Ville').size()

Ville
Lyon         1
Marseille    1
Nice         1
Paris        1
Toulouse     1
dtype: int64

In [28]:
df['Âge'].apply(lambda x :  x + 1)

0    26
1    31
2    36
3    41
4    46
Name: Âge, dtype: int64

In [33]:
df['Catégorie'] = df['Âge'].apply(lambda x : 'jeune' if x < 40 else 'senior')
df.head(9)

       Nom  Âge      Ville  SalaireMensuel Catégorie
0    Alice   25      Paris            3000     jeune
1      Bob   30       Lyon            3500     jeune
2  Charlie   35  Marseille            4000     jeune
3    David   40   Toulouse            4500    senior
4      Eva   45       Nice            5000    senior

In [34]:
df2 = pd.DataFrame({
    'Nom': ['Alice', 'Bob', 'Claire'],
    'Département': ['IT', 'HR', 'Finance']
})

# Fusion sur la colonne 'Nom'
pd.merge(df, df2, on='Nom', how='left')

       Nom  Âge      Ville  SalaireMensuel Catégorie Département
0    Alice   25      Paris            3000     jeune          IT
1      Bob   30       Lyon            3500     jeune          HR
2  Charlie   35  Marseille            4000     jeune         NaN
3    David   40   Toulouse            4500    senior         NaN
4      Eva   45       Nice            5000    senior         NaN

In [36]:
df[df['SalaireMensuel']>4000]

     Nom  Âge     Ville  SalaireMensuel Catégorie
3  David   40  Toulouse            4500    senior
4    Eva   45      Nice            5000    senior

In [38]:
df['Ancienneté'] = random.random()

NameError: name 'random' is not defined